#+TITLE: test
#+DATE: <2016-04-10 Sun>
#+AUTHOR: Charles Berry
#+EMAIL: ccberry@ucsd.edu
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)
#+DESCRIPTION: unit tests for ox-ravel


** run tests

After running the [[define setup and tests][setup]]:

Run the tests like this:

: M-x ert RET "ox-ravel/.*" RET

or by executing this block

#+BEGIN_SRC emacs-lisp
  (ert "ox-ravel/.*" "ravel-ert-buffer")
  (with-temp-buffer
    (insert-buffer-substring "ravel-ert-buffer")
    (kill-buffer "ravel-ert-buffer")
    (buffer-substring-no-properties (point-min) (point-max)))
#+END_SRC

#+RESULTS:
#+begin_example
Selector: "ox-ravel/.*"
Passed:  6
Failed:  0
Skipped: 0
Total:   6/6

Started at:   2016-12-24 09:12:24-0800
Finished.
Finished at:  2016-12-24 09:12:25-0800

......


#+end_example


See =/path/to/org-mode/testing/README= for more details on testing.
